import pandas as pd

data = {
   'Name': ['Анна', 'Антон', 'Мария', 'Макс', 'Макс', 'Алекс', 'Антон', 'Мария', 'Макс', 'Алекс', 'Антон', 'Анна'],
   'Game': ['тетрис', 'змейка', 'змейка', 'тетрис', 'тетрис', 'змейка', 'тетрис', 'тетрис', 'тетрис', 'змейка', 'змейка', 'тетрис'],
    'Points': [145, 2524, 343, 4212, 5212, 6421, 745, 842, 524, 3224, 212, 1214]
    }

df = pd.DataFrame(data)
df_result = pd.crosstab(df['Name'], df['Game'], values=df['Points'], aggfunc='mean')

print(df)
print(df_result)